{
  "Sheet1": [
    [
      "About us",
      null,
      null,
      "Reference Website"
    ],
    [
      null,
      "Introduction",
      "Elation Engineering Pvt Ltd was established in 2021 by IIT alumni with a dream to provide innovative processing solutions in economical way to global food processing industries. Our 24 x 7 completely dedicated customer focus, strong work ethics , constant knowledge upgradation along wide experience in this field helping us to take strong steps towards making our dream a reality."
    ],
    [
      null,
      "Vision",
      "To become One Stop Solution Provider for Global Food Processing Sector"
    ],
    [
      null,
      "Mission",
      "To become trustworthy technical stakeholder for our customers by providing innovative and economical processing solutions"
    ],
    [],
    [
      "Services",
      "Pre-Project Activities : The pre-project phase is crucial for establishing a strong foundation in the food and beverage sector. We provide comprehensive support throughout all pre-project activities, ensuring that every detail — from concept development to feasibility analysis — is strategically planned for long-term success.",
      "Concept Development \r\nMarket Survey\r\nBusiness Forecasting \r\nBusiness Case \r\nStakeholder Analysis \r\nProject Report"
    ],
    [
      null,
      "Product Design and Development : The process of food product design and development involves several key stages, each essential for successfully bringing a product to market. Our expert team and state-of-the-art facilities provide comprehensive support to design and develop the most innovative and effective food products that meet market demands and consumer expectations.",
      "New Product Development\r\nValue Addition to Existing Product\r\nModernization of Indigenous Product\r\nLocalization of Exotic Product\r\nProduct Standardization\r\nProduct Testing\r\nPatent Processing\r\nStreamlining of Compliances"
    ],
    [
      null,
      "Engineering services :We provide specialized expertise in engineering solutions to drive efficiency, safety, and innovation. Our engineering services are essential for optimizing processes, enhancing product quality, and reducing costs across diverse industries. They also play a critical role in promoting sustainability, ensuring safety, and maintaining regulatory compliance. By leveraging advanced technologies, we further amplify efficiency, innovation, and long-term operational excellence.",
      "Process Design \r\nPlant Design \r\nProcess and Utility Equipment Design \r\nEquipment Selection \r\nVendor Selection and Development \r\nEstimation of Bill of Material \r\nInstallation Activities \r\nProduct Trials \r\nMaintenance System \r\nEngineering Documentation"
    ],
    [
      null,
      "Project Management : Project management ensures proper planning of tasks and the timely achievement of defined goals. It serves as a systematic approach to planning, organizing, and controlling resources, fostering effective collaboration between team members and stakeholders. The importance of project management extends across various sectors, facilitating efficient delivery while minimizing risks. We provide comprehensive project management services in alignment with PMI standards.",
      "Scope Management \r\nSchedule Management\r\nCost Management \r\nQuality Management \r\nResource Management \r\nCommunication Management \r\nRisk Management \r\nProcurement Management \r\nStakeholder Management \r\nProject Integration Management \r\nProject Document"
    ],
    [
      null,
      "Site Activities :  We provide a complete package of site activities, including unloading, unpacking, shifting, installation, piping, and commissioning of equipment. On-site activities are critical for enforcing safety protocols and preventing accidents, ensuring the wellbeing of workers and compliance with regulatory standards. Our trained site engineers closely monitor workmanship, materials, and methods to ensure that all site activities meet design specifications and quality requirements.",
      "Installation of process and utility equipment\r\nInterconnecting piping \r\nSite work quality control \r\nSite safety system \r\nStatutory requirements and certifications \r\nProcess and utility testing \r\nCommissioning of process plant \r\nSite resource management \r\nSite work documentation"
    ],
    [
      null,
      "Equipment Maintenance and Retrofits: Regular maintenance prevents unexpected breakdowns, ensuring equipment operates reliably and meets production or operational targets. Proper maintenance and timely retrofits extend the lifespan of machinery, reducing the need for frequent replacements and minimizing capital expenditure. Additionally, retrofitting enables older equipment to incorporate modern technologies, enhancing functionality, automation, and compatibility with current processes.",
      "Annual maintenance for\r\n _Homogeniser\r\n_Steriliser \r\n_Pasteuriser\r\n_Process pump\r\n_Filling Machines\r\n_Automation System\r\nProcess improvement solutions to existing equipment for\r\n_ Adding new products \r\n_Increasing performance of existing equipment \r\n_Complying statutory requirement"
    ],
    [],
    [
      "Equipment Manufacturing",
      "Pressure Vessels",
      "With our extensive design and fabrication expertise, we offer durable and robust Pressure Vessels. Our range of Pressure Vessels is crafted from premium-grade raw materials and manufactured in compliance with global quality standards to ensure maximum performance, reliability, and efficiency. We are committed to delivering precision-engineered, safe, and high-quality pressure vessels designed for long-term industrial use."
    ],
    [
      null,
      "Heat Exchangers",
      "We believe that customization is key to delivering the best solutions. Backed by extensive experience in the thermal design and manufacturing of heat exchangers, we offer a wide range of products including Shell and Tube Heat Exchangers, Corrugated Tube Heat Exchangers, and Spiral Heat Exchangers. Each unit is designed to meet specific process requirements and provides highly energy-efficient and reliable heat transfer solutions."
    ],
    [
      null,
      "Agitated Tanks",
      "Agitator Tanks are used for dispersing, suspending, emulsifying, and homogenizing liquids and pastes. We design and manufacture a wide range of agitators suitable for various processes in the pharmaceutical, chemical, food, cosmetics, and related industries.\r\nOur agitators are equipped with different types of agitation components to perform processes such as mixing, blending, dissolution, dispersion, homogenization, reaction, fermentation, oxidation, digestion, and emulsification of liquids, pastes, ointments, solutions, viscous materials and solid-liquid mixtures."
    ],
    [
      null,
      "Storage Silos",
      "We design and supply storage silos and tanks that play a pivotal role in maintaining product quality. Each unit is engineered with precision to meet the stringent requirements of hygiene, temperature control, and efficient drainage.Constructed from high-quality materials, our tanks ensure superior hygiene, excellent corrosion resistance, and are easy to clean and maintain. Depending on process requirements, various accessories such as temperature and level control systems, agitation mechanisms, and hot or cold insulation can be integrated.We offer storage tanks and silos with capacities ranging from 1,000 L to 150,000 L, designed to deliver reliable performance and long service life across diverse industrial applications."
    ],
    [
      null,
      "Reactors",
      "With the support of our expert team, we design and manufacture a wide range of reactors that are highly scalable—suitable for both small-scale laboratory applications and large-scale industrial processes. This flexibility makes them ideal for diverse industries and production requirements.Our reactors are engineered and fabricated using high-quality components, modern machinery, and precision-built coil vessels, ensuring durability and optimal performance. Each reactor is constructed from stainless steel and comprises essential parts such as coils, vessels, valves, and other critical fittings. The integrated coil system allows for the circulation of heating or cooling media, enabling precise temperature control of the reactants throughout the process."
    ],
    [],
    [
      "Automation",
      "Automation and control systems are vital technologies that regulate and optimize processes across diverse industries, improving efficiency, precision, and reliability. Their integration plays a key role in advancing technological innovation across multiple sectors. By enhancing performance, minimizing errors, and enabling intelligent solutions, these systems significantly boost productivity and safety in everyday operations. For professionals in engineering and technology, understanding automation and control systems is essential, as these technologies continue to evolve and shape the future of modern industry.",
      "Control System Design, Panel Manufacturing, Cabling and Electrical Installation\r\nSystem integration with HMI Software and SQL Reporting.\r\n21 CFR compliance and batch solutions as per ISA standards.\r\nInstallation and Commissioning. \r\nSoftware up-gradations & Legacy H/w Migration to new versions.\r\nPart Management Services for spares.\r\nExtended Warranty to protect customer’s investment\r\n24X7 Tech Support \r\nRemote Connectivity for Plant Monitoring & Troubleshooting\r\nAnnual Maintenance Contract & Customer Training"
    ],
    [],
    [
      "Audits, Certifications ",
      "Audits in the food industry are systematic and independent evaluations of a company’s processes, systems, and procedures to assess compliance with regulatory requirements, industry standards, and customer expectations. These audits help identify potential risks and hazards that could compromise food safety and product quality.\r\nThey play a vital role in ensuring adherence to government regulations and demonstrating a company’s commitment to maintaining high standards of food safety and quality. This commitment is essential for building customer trust and sustaining a strong reputation in the market. Moreover, audits provide valuable opportunities for continuous improvement—helping companies pinpoint weaknesses, implement corrective actions, enhance operational efficiency, reduce costs, and ultimately improve customer satisfaction.",
      "ISO 9001 : 2015 – Quality Management System \r\nISO 22000 : 2018 – Food Safety Management System \r\nISO 28000 : 2007 – Risk in Supply Chain Management \r\nEMS 140001 – Environmental Management System \r\nOHSAS 18001- Occupational Health and Safety Assessment \r\nHACCP – Hazard Analysis Critical Control Point\r\nGMP &  GHP – Good Manufacturing and Hygienic Practices"
    ],
    [],
    [
      "Training and Consulting ",
      "Training in food processing is extremely important for several reasons — both for individuals working in the industry and for the overall safety and quality of food products.\r\nTraining helps employees understand quality control measures and processing standards.\r\nTraining helps in proper equipment maintenance, leading to longer machine life and fewer breakdowns\r\nTraining ensures that employees understand and follow these legal and safety requirements.\r\nWith proper training, team can adapt to new technologies, automation, and processing methods.\r\nProper handling and processing techniques minimize raw material loss.\r\nWell-trained team help improve yield and reduce energy and water consumption.\r\n",
      "Food Processing System\r\nProcess Quality Improvement\r\nProject Management\r\nEquipment Maintenance System\r\nElectrical and Automation System\r\nFood Safety Management System"
    ],
    [],
    [
      "Advance Technologies",
      "Continuous Sugar Dissolving System",
      "Continuous sugar dissolving systems are advanced technologies designed to efficiently dissolve sugar in water, ensuring consistent syrup quality and optimal production processes in the food and beverage industry.\r\nOur Continuous sugar dissolving systems are useful in various industries, particularly in beverage and food production. These systems allow for the continuous mixing of sugar with water, producing a homogeneous sugar solution (syrup) that can be used in various applications, such as soft drinks, sauces, and other food products.\r\nWe can also design and supply dry sugar handling system, activiated carbon system, filtration system, syrup pasteurisation system. \r\nThis system provides precise control over the sugar concentration, reducing waste and ensuring consistent quality in production."
    ],
    [
      null,
      "Microwave Heating and High Frequency Applications",
      "Microwave heating utilizes electromagnetic waves in the microwave frequency range to generate heat within materials by inducing molecular motion. This efficient and rapid heating method finds applications across various fields, including food processing, pharmaceuticals etc. In the food industry, microwave heating is employed for cooking, thawing, and drying processes, offering advantages such as reduced processing time and improved product quality. Similarly, in pharmaceutical manufacturing, microwave heating enables precise temperature control during synthesis and purification processes, leading to enhanced product yields and purity.\r\nHigh-frequency heating involves the application of electromagnetic waves with frequencies higher than those used in conventional microwave heating.",
      "https://aimhha.org/"
    ],
    [
      null,
      "Waste Water Management",
      "For more sustainable use of water resources, we provide residential, commercial, and industrial wastewater treatment plants. They help in removing contaminants, protecting water bodies and recycling water. Our process solution range in waste water treatment system includes Sewage water treatment plant, Effluent treatment plant, Anaerobic reactor, Dissolved air floatation, MBBR effluent treatment, Membrane bio reactor, Continuous fill batch reactor, Sequential batch reactor.",
      "Waste Water Treatment Plant | Industrial & Municipal Solutions"
    ],
    [
      null,
      "Water Treatment System",
      "We are having experience handling water from sea, borewell, river, and surface sources through various stages of treatment such as pre-treatment, ultrafiltration, reverse osmosis, nanofiltration, etc. Based on the water analysis we can develop a concept that meets the specific application requirements. Our water processing solutions includes pretreatment, reverse osmosis, post treatment, ultra filtration, Hi Purity RO plants, Closed circuit reverse osmosis.\r\nReverse osmosis plant, Multi Media filter, High Rate Solid Contact Clarifier, Turbidity Treatment, Mineral Dosing, Iron Removal, Silica Removal, Seawater Desalination, Brackish Water Reverse Osmosis, Mixed Bed Deionizer, Electrodeionization,Ozonation & UV etc",
      "https://alantech.in/raw-water-treatment"
    ],
    [
      null,
      "Ultra High Pressure Homogenisation",
      "Our product range of homogenisers is 200 Bar g to 1500 Bar g with flow rate from 40 Lph to 6000 Lph. With extensive research and development, our homogenisers provide uniform particle size reduction and effective cell disruption. Our effective design provide high efficiency resulting desired quality with energy saving.  Homogenization technology uses efficient high pressure energy to break particles present in fluids to the smallest possible size, down to nanometer range. This process creates a stable emulsion or dispersion by forcing the product through a specifically engineered homogenizing valve under high density fluid-dynamic energy conditions thus improving product shelf life and performance.\r\n\r\n",
      "GSS"
    ],
    [
      null,
      "Powder Transfer System",
      "Our Powder Transfer Systems (PTS) are specialized equipment used to move powder materials from one location to another in a safe, efficient, and contained manner. These systems are essential in industries where handling powders can pose safety risks or where contamination control is critical. PTS is widely used in pharmaceutical, chemical, food, and polymer processing industries to ensure the integrity and safety of both the product and the operators. The vacuum powder transfer system operates by using a vacuum to create a low-pressure area that enables the movement of powder from a source to a destination.\r\nOur PTS systems ensure that powders are transferred in a safe environment. They speed up production processes, minimize the risk of contamination, handle dense phase conveying with low velocity and reduce the risk of electrostatic charges during transfer."
    ],
    [
      null,
      "Industrial Refrigeration",
      "We provide innovative industrial refrigeration process solutions  and execute them with quality workmanship. We provide various refrigeration applications like Precooling, High Rh cold storage, Deep Freezer, Blast Freezer, IQF, Dehumidification, Ripening chamber etc. We can design the refrigeration systems with R22,R404a,R717 etc.\r\nDifferent applications of our refrigeration systems are for Frozen food ( - 40 Deg C ), Brine Chiller Package ( -10 to -40 Deg C ), Process Chillers (-5 to -40 Deg C) Utility Chillers (+5 to -10 Deg C).\r\nWe provide customised refrigeration system including Compressor, highly efficient heat exchanger, pressure vessels, PLC system with field instrumentation and process piping"
    ],
    [],
    [
      "Process and Packaging System"
    ],
    [
      null,
      "Milk and Milk Product Processing",
      "_ Liquid Milk Processing\r\n_ Aseptic Milk Processing\r\n_ Paneer Processing\r\n_Cheese Processing\r\n_ Curd, Butter, Buttermilk Processing\r\n_ Ice-cream Processing\r\n_ Indigenous Sweets processing\r\n"
    ],
    [
      null,
      "Beverage Processing",
      "_Fruit Juice Processing\r\n_Carbonated Beverage Processing\r\n_Aseptic Pulp Processing\r\n_Health drink Processing\r\n_Flavoured Water Processing\r\n_Milk based Beveragges"
    ],
    [
      null,
      "Fruit and Vegetable Processing",
      "_ Aseptic Processing of fruits and Vegetables\r\n_Canning of fruits and Vegetables\r\n_Drying of fruits and Vegetables\r\n_Fermentation of fruits and Vegetables\r\n_Freezing of  fruits and Vegetables\r\n_Jam, Jelly, Pickles,Ketchup, Sauce etc \r\n"
    ],
    [
      null,
      "Food Processing",
      "_Chocolate Processing\r\n_Spices Processing\r\n_Ready to Cook and Ready to Eat products processing\r\n_Biscuits, Cookies and Other Bakery product processing\r\n_Millets based products processing\r\n_High Protein products processing"
    ],
    [
      null,
      "Packaging and Conveying System",
      "_PET Filling line with Blow Moulder,Rinser, Filler , Capper\r\n_Gallon Filling Line with Decapper, Leak tester, Washer, Filler, Capper,Sleeve Applicator\r\n_Gas Bottle Line with Sticker Labeller, Inline Capper,Bottle Washer\r\n_Shrink wrapper,Labeller,Carton Packer \r\n_Air conveyor, Bottle Conveyor, Pack Conveyor, Roller Conveyor"
    ]
  ]
}