{
  "Cusotmer Says": "Elation Engineering Pvt. Ltd. has demonstrated exceptional proficiency in detailed engineering as well as in overall project execution. Their technical expertise, timely delivery, and commitment to maintaining quality standards have been consistently impressive. We also appreciate their continued support and responsiveness even after the project’s completion, which reflects their strong dedication to customer satisfaction\n\nMr Ajay Jain \n\nManaging Director - Jain Agro Food Products Private Limited, Bangalore Karnataka\n\n\n\nWe are very pleased with the support provided by Elation Engineering Pvt. Ltd. They helped us standardize the processes in our bulk food processing units, which significantly increased our production efficiency. The solutions suggested by EEPL were practical, simple to implement, and remarkably cost-effective. Their guidance has truly strengthened our operations, and we highly value their expertise\n\nMr Sanath Kumara Shetty \n\nFounding Partner – Mint The Kitchen, Bangalore Karnataka\n\n\n\nWe are extremely satisfied with the support provided by Elation Engineering Pvt. Ltd. They helped us develop innovative engineering solutions for our products, and their design capabilities truly stand out. The team understood our requirements perfectly and delivered the solutions on time. They are incredibly supportive and professional, making it very easy and comfortable for us to work with them.\n\nMr. S.M.Sawant \n\nDirector – MIPL Pune Maharashtra\n\n\n\nWe are grateful for the outstanding automation support from Elation Engineering Pvt. Ltd. Their expertise in system design and programming gives us a strong technological edge, and their 24×7 support has been invaluable for our operations.\n\nMr Anshul Jain\n\nManaging Director - Proveg Engineering & Food Processing Pvt. Ltd Kota Rajastan\n\n\n\n\n\n\n\n\n\n\n\n",
  "Our team": "\n\nMr Vivek Jagtap\n\nFounder\n\nM. Tech IIT Kharagpur\n\n\n\n\n\nMr Jagdish Bainagari\n\nAutomation System Expert\n\n\n\n\n\nMr Pandarinath Pandit\n\nEngineering Desing Expert\n\n",
  "Career": "Project Manager\n\nExperience: 3 to 4 Years\n\nLocation: Pune\n\nEducational Qualifications: B. Tech preferably from Food Tech\n\nJob Description:  1. End to End Project Management including project scope, cost and schedule \n\n                               2. Coordination of all internal and external project stake holders\n\n                               3. Preparation and submission of Project Report\n\n                               4. Ensuring high quality of all project deliverables \n\n\n\nSales Coordinator\n\nExperience: 2 to 3 Years\n\nLocation: Pune\n\nEducational Qualifications: B. Tech preferably from Food Tech\n\nJob Description:  1. Preparation and maintenance of Sales databases\n\n                               2. Making the cold calls to customers\n\n                               3. Coordination of all internal and external Sales stake holders\n\n                               3. Continuous follow up for sales leads\n\n                               \n\n\n\n\n\n                               \n\n\n\n"
}